In [14]:
class zno:
    def __init__(self, name, number, rating, upTo200, gender):
        self.name = name
        self.number = number
        self.rating = rating
        self.upTo200 = upTo200
        self.gender = gender

In [2]:
import sqlite3

In [37]:
conn = sqlite3.connect("zno.db")
cursor = conn.cursor()
cursor.execute("""CREATE TABLE zno
                  (name text, 
                  number integer,
                  rating integer,
                   upTo200 integer,
                   gender text)
               """)

In [38]:
cursor.execute("""INSERT INTO zno
                  VALUES ('Bohdan', '2', '167',
                  '33', 'male'),
                  ('Alice', '7', '190',
                  '10', 'female'),
                  ('Anastacia', '1', '115',
                  '85', 'female'),
                  ('Maria', '15', '178',
                  '22', 'female'),
                  ('Vasyl', '6', '199',
                  '1', 'male')"""
               )
conn.commit()

In [39]:
sql1 = "SELECT * FROM zno"
cursor.execute(sql1)
print(cursor.fetchall())

[('Bohdan', 2, 167, 33, 'male'), ('Alice', 7, 190, 10, 'female'), ('Anastacia', 1, 115, 85, 'female'), ('Maria', 15, 178, 22, 'female'), ('Vasyl', 6, 199, 1, 'male')]

In [59]:
sql2 = "SELECT * FROM zno WHERE name = 'Alice'"
cursor.execute(sql2)
print(cursor.fetchall())

[('Alice', 7, 190, 10, 'female')]

In [54]:
sql3 = "SELECT * FROM zno WHERE number = 1"
cursor.execute(sql3)
print(cursor.fetchall())

[('Anastacia', 1, 115, 85, 'female')]

In [61]:
sql4 = "UPDATE zno SET name = 'Alice' WHERE number = 15 OR number = 1"
cursor.execute(sql4)

In [62]:
sql1 = "SELECT * FROM zno"
cursor.execute(sql1)
print(cursor.fetchall())

[('Bohdan', 2, 167, 33, 'male'), ('Alice', 7, 190, 10, 'female'), ('Alice', 1, 115, 85, 'female'), ('Alice', 15, 178, 22, 'female'), ('Vasyl', 6, 199, 1, 'male')]

In [63]:
sql2 = "SELECT * FROM zno WHERE name = 'Alice'"
cursor.execute(sql2)
print(cursor.fetchall())

[('Alice', 7, 190, 10, 'female'), ('Alice', 1, 115, 85, 'female'), ('Alice', 15, 178, 22, 'female')]

In [64]:
sql3 = "SELECT * FROM zno WHERE number = 1"
cursor.execute(sql3)
print(cursor.fetchall())

[('Alice', 1, 115, 85, 'female')]